DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
/**
 * @file lh2.c
 * @addtogroup BSP
 *
 * @brief  nRF52833-specific definition of the "lh2" bsp module.
 *
 * @author Filip Maksimovic <filip.maksimovic@inria.fr>, Said Alvarado-Marin <said-alexander.alvarado-marin@inria.fr>
 *
 * @copyright Inria, 2022
 */
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <stdbool.h>
#include <nrf.h>

#include "timer_hf.h"
#include "lh2.h"

//=========================== defines =========================================

#define SPIM3_INTERRUPT_PRIORITY 1    ///< Interrupt priority, as high as it will go
#define SPI3_BUFFER_SIZE         64   ///< Size of buffers used for SPI communications
#define LH2_PACKET_SIZE          5    ///< magic number definitions
#define I_AM_ROBOT               420  ///< THIS ROBOT IS NUMBER

#define LH2_D_PIN 29
#define LH2_E_PIN 30

#define FUZZY_CHIP 0xFF

#define LH2_LOCATION_ERROR_INDICATOR           0xFFFFFFFF
#define LH2_POLYNOMIAL_ERROR_INDICATOR         255
#define POLYNOMIAL_BIT_ERROR_INITIAL_THRESHOLD 4

// gpiote definitions
#define GPIOTE_CH_OUT           0
#define GPIOTE_CH_IN_ENV_HiToLo 1
#define GPIOTE_CH_IN_ENV_LoToHi 2

#define OUTPUT_PIN_NUMBER 31
#define OUTPUT_PIN_PORT   0UL
#define INPUT_PIN_NUMBER  30
#define INPUT_PIN_PORT    0UL

// SPI pin definitions
#define FAKE_SCK_PIN 6  // NOTE: SPIM needs an SCK pin to be defined, otherwise it doesn't work. \
                        // nRF52840 P1.6 is used because it's not an available pin in the BCM module.

typedef struct {
    uint8_t transfer_counter;
    bool    buffers_ready;
} lh2_vars_t;

//=========================== variables ========================================

static lh2_vars_t _lh2_vars;

// variable where location packet is stored
uint32_t lh2_packet[LH2_PACKET_SIZE];

uint32_t lh2_results[8];

// initialize LH2 demodulation variables
// bits sweep is the result of the demodulation, sweep_N indicates which SPI transfer those bits are associated with
volatile uint64_t LH2_bits_sweep_1 = 0;
volatile uint64_t LH2_bits_sweep_2 = 0;
volatile uint64_t LH2_bits_sweep_3 = 0;
volatile uint64_t LH2_bits_sweep_4 = 0;

// selected poly is the polyomial # (between 0 and 31) that the demodulation code thinks the demodulated bits are a part of, initialize to error state
volatile int LH2_selected_poly_1 = LH2_POLYNOMIAL_ERROR_INDICATOR;
volatile int LH2_selected_poly_2 = LH2_POLYNOMIAL_ERROR_INDICATOR;
volatile int LH2_selected_poly_3 = LH2_POLYNOMIAL_ERROR_INDICATOR;
volatile int LH2_selected_poly_4 = LH2_POLYNOMIAL_ERROR_INDICATOR;

// bit_offset indicates an offset between the start of the packet, as indicated by envelope dropping, and the 17-bit sequence that is verified to be in a known LFSR sequence
int LH2_bit_offset_1 = 0;
int LH2_bit_offset_2 = 0;
int LH2_bit_offset_3 = 0;
int LH2_bit_offset_4 = 0;

// LFSR location is the position in a given polynomial's LFSR that the decoded data is, initialize to error state
volatile uint32_t LH2_LFSR_location_1 = LH2_LOCATION_ERROR_INDICATOR;  // mark as all Fs, so that if the receiver gets a -1 (signed) it knows something went horribly wrong
volatile uint32_t LH2_LFSR_location_2 = LH2_LOCATION_ERROR_INDICATOR;
volatile uint32_t LH2_LFSR_location_3 = LH2_LOCATION_ERROR_INDICATOR;
volatile uint32_t LH2_LFSR_location_4 = LH2_LOCATION_ERROR_INDICATOR;

// initialize envelope duration storage variables
volatile uint32_t LH2_envelope_duration_1 = 0xFFFFFFFF;  // initialize to all 1s, error state
volatile uint32_t LH2_envelope_duration_2 = 0xFFFFFFFF;
volatile uint32_t LH2_envelope_duration_3 = 0xFFFFFFFF;
volatile uint32_t LH2_envelope_duration_4 = 0xFFFFFFFF;

// Define SPI buffer
static uint8_t m_tx_buf[SPI3_BUFFER_SIZE] = { 0 };
static uint8_t m_rx_buf[SPI3_BUFFER_SIZE] = { 0 };

// arrays of bits for local storage, contents of SPI transfer are copied into this
uint8_t stored_buff[128];  // TODO: make these local variables inside of main - no reason for them to be glob
uint8_t stored_buff_1[128];
uint8_t stored_buff_2[128];
uint8_t stored_buff_3[128];
uint8_t stored_buff_4[128];

//=========================== prototypes =======================================

// these functions are called in the order written to perform the LH2 localization
void _initialize_ts4231(void);

uint64_t _demodulate_light(uint8_t *sample_buffer);

uint64_t _poly_check(uint32_t poly, uint32_t bits, uint8_t numbits);
int      _determine_polynomial(uint64_t chipsH1, int *start_val);

uint64_t _hamming_weight(uint64_t bits_in);

uint32_t _reverse_count_p0(uint32_t bits);
uint32_t _reverse_count_p1(uint32_t bits);
uint32_t _reverse_count_p2(uint32_t bits);
uint32_t _reverse_count_p3(uint32_t bits);

// setup the PPI
void _gpiote_setup(void);
void _ppi_setup(void);
void _spi3_setup(void);
void _timer2_setup(void);

// Said Set-Up
void _lh2_pin_set_input(uint8_t pin);
void _lh2_pin_set_output(uint8_t pin);

//=========================== public ===========================================

void db_lh2_init(void) {
    // Initialize the TS4231 on power-up - this is only necessary when power-cycling
    _initialize_ts4231();

    // Configure the necessary Pins in the GPIO peripheral  (MOSI and CS not needed)
    _lh2_pin_set_input(LH2_D_PIN);      // Data_pin will become the MISO pin
    _lh2_pin_set_output(FAKE_SCK_PIN);  // set SCK as Output.

    _spi3_setup();

    // Setup the LH2 local variables
    _lh2_vars.transfer_counter = 0;
    _lh2_vars.buffers_ready    = false;

    // initialize GPIOTEs
    _gpiote_setup();
    // initialize timer(s)
    _timer2_setup();
    // initialize PPI
    _ppi_setup();
}

bool db_lh2_get_black_magic(void) {
    uint8_t i;
    uint8_t j;
    // invalid packet detection:
    int8_t invalid_packet_counter;

    if (_lh2_vars.buffers_ready) {
        _lh2_vars.buffers_ready = false;

        LH2_bits_sweep_1 = 0;
        LH2_bits_sweep_2 = 0;
        LH2_bits_sweep_3 = 0;
        LH2_bits_sweep_4 = 0;

        // perform the demodulation + poly search on the received packets
        // convert the SPI reading to bits via zero-crossing counter demodulation and differential/biphasic manchester decoding
        LH2_bits_sweep_1 = _demodulate_light(stored_buff_1);
        LH2_bits_sweep_2 = _demodulate_light(stored_buff_2);
        LH2_bits_sweep_3 = _demodulate_light(stored_buff_3);
        LH2_bits_sweep_4 = _demodulate_light(stored_buff_4);

        // figure out which polynomial each one of the two samples come from.
        LH2_selected_poly_1 = _determine_polynomial(LH2_bits_sweep_1, &LH2_bit_offset_1);
        LH2_selected_poly_2 = _determine_polynomial(LH2_bits_sweep_2, &LH2_bit_offset_2);
        LH2_selected_poly_3 = _determine_polynomial(LH2_bits_sweep_3, &LH2_bit_offset_3);
        LH2_selected_poly_4 = _determine_polynomial(LH2_bits_sweep_4, &LH2_bit_offset_4);

        if ((LH2_selected_poly_1 == LH2_POLYNOMIAL_ERROR_INDICATOR) |
            (LH2_selected_poly_2 == LH2_POLYNOMIAL_ERROR_INDICATOR) |
            (LH2_selected_poly_3 == LH2_POLYNOMIAL_ERROR_INDICATOR) |
            (LH2_selected_poly_4 == LH2_POLYNOMIAL_ERROR_INDICATOR)) {  // failure to find one of the two polynomials - start from scratch and grab another capture
            _lh2_vars.transfer_counter = 0;
            db_lh2_start_transfer();
            return false;
        } else {
            // find location of the first data set by counting the LFSR backwards
            if (LH2_selected_poly_1 == 0) {  // TODO: functionalize this nested if statement to clean up the main/applet code
                LH2_LFSR_location_1 = _reverse_count_p0(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            } else if (LH2_selected_poly_1 == 1) {
                LH2_LFSR_location_1 = _reverse_count_p1(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            } else if (LH2_selected_poly_1 == 2) {
                LH2_LFSR_location_1 = _reverse_count_p2(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            } else if (LH2_selected_poly_1 == 3) {
                LH2_LFSR_location_1 = _reverse_count_p3(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            }
            // find location of the second data set
            if (LH2_selected_poly_2 == 0) {
                LH2_LFSR_location_2 = _reverse_count_p0(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            } else if (LH2_selected_poly_2 == 1) {
                LH2_LFSR_location_2 = _reverse_count_p1(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            } else if (LH2_selected_poly_2 == 2) {
                LH2_LFSR_location_2 = _reverse_count_p2(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            } else if (LH2_selected_poly_2 == 3) {
                LH2_LFSR_location_2 = _reverse_count_p3(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            }

