DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
            // find location of the third data set
            if (LH2_selected_poly_3 == 0) {
                LH2_LFSR_location_3 = _reverse_count_p0(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            } else if (LH2_selected_poly_3 == 1) {
                LH2_LFSR_location_3 = _reverse_count_p1(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            } else if (LH2_selected_poly_3 == 2) {
                LH2_LFSR_location_3 = _reverse_count_p2(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            } else if (LH2_selected_poly_3 == 3) {
                LH2_LFSR_location_3 = _reverse_count_p3(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            }

            // find location of the fourth data set
            if (LH2_selected_poly_4 == 0) {
                LH2_LFSR_location_4 = _reverse_count_p0(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            } else if (LH2_selected_poly_4 == 1) {
                LH2_LFSR_location_4 = _reverse_count_p1(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            } else if (LH2_selected_poly_4 == 2) {
                LH2_LFSR_location_4 = _reverse_count_p2(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            } else if (LH2_selected_poly_4 == 3) {
                LH2_LFSR_location_4 = _reverse_count_p3(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            }
        }

        // packet structure:
        // packet[0] is the robot #
        // packet[1-4] are the results from the four sweeps organized in 32-bit chunks as follows:
        //        env. duration                    poly #                             location in LFSR
        // [  -  -  -  -  -  -  -  -  -  -  |  -  -  -  -  -  |  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  -  ]
        //           10 bits                       5 bits                               17 bits (max)
        //
        lh2_packet[0] = I_AM_ROBOT;
        lh2_packet[1] = ((LH2_envelope_duration_1 & 0x000003FF) << 22) | ((LH2_selected_poly_1 & 0x0000001F) << 17) | ((LH2_LFSR_location_1 & 0x0001FFFF));
        lh2_packet[2] = ((LH2_envelope_duration_2 & 0x000003FF) << 22) | ((LH2_selected_poly_2 & 0x0000001F) << 17) | ((LH2_LFSR_location_2 & 0x0001FFFF));
        lh2_packet[3] = ((LH2_envelope_duration_3 & 0x000003FF) << 22) | ((LH2_selected_poly_3 & 0x0000001F) << 17) | ((LH2_LFSR_location_3 & 0x0001FFFF));
        lh2_packet[4] = ((LH2_envelope_duration_4 & 0x000003FF) << 22) | ((LH2_selected_poly_4 & 0x0000001F) << 17) | ((LH2_LFSR_location_4 & 0x0001FFFF));

        lh2_results[0] = (uint32_t)LH2_selected_poly_1;
        lh2_results[2] = (uint32_t)LH2_selected_poly_2;
        lh2_results[4] = (uint32_t)LH2_selected_poly_3;
        lh2_results[6] = (uint32_t)LH2_selected_poly_4;
        lh2_results[1] = LH2_LFSR_location_1;
        lh2_results[3] = LH2_LFSR_location_2;
        lh2_results[5] = LH2_LFSR_location_3;
        lh2_results[7] = LH2_LFSR_location_4;

        // detect invalid packets
        invalid_packet_counter = 0;
        for (i = 0; i < 7; i += 2) {
            if ((lh2_results[i] == 0) || (lh2_results[i] == 1)) {
                invalid_packet_counter++;  // from LHA
            } else if ((lh2_results[i] == 2) || (lh2_results[i] == 3)) {
                invalid_packet_counter--;  // from LHB
            }
        }
        if ((invalid_packet_counter == 1) || (invalid_packet_counter == -1)) {
            return false;  // odd # of packets from 1 LH, erroneous result
        }

        if ((invalid_packet_counter == 4) || (invalid_packet_counter == -4)) {
            // results from one LH2 were discovered - sort the two pairs
            if (LH2_LFSR_location_1 > LH2_LFSR_location_2) {
                lh2_results[0] = (uint32_t)LH2_selected_poly_2;
                lh2_results[2] = (uint32_t)LH2_selected_poly_1;
                lh2_results[1] = LH2_LFSR_location_2;
                lh2_results[3] = LH2_LFSR_location_1;
            } else {
                lh2_results[0] = (uint32_t)LH2_selected_poly_1;
                lh2_results[2] = (uint32_t)LH2_selected_poly_2;
                lh2_results[1] = LH2_LFSR_location_1;
                lh2_results[3] = LH2_LFSR_location_2;
            }
            if (LH2_LFSR_location_3 > LH2_LFSR_location_4) {
                lh2_results[0] = (uint32_t)LH2_selected_poly_4;
                lh2_results[2] = (uint32_t)LH2_selected_poly_3;
                lh2_results[1] = LH2_LFSR_location_4;
                lh2_results[3] = LH2_LFSR_location_3;
            } else {
                lh2_results[0] = (uint32_t)LH2_selected_poly_3;
                lh2_results[2] = (uint32_t)LH2_selected_poly_4;
                lh2_results[1] = LH2_LFSR_location_3;
                lh2_results[3] = LH2_LFSR_location_4;
            }
        }

        memset(stored_buff_1, 0, sizeof(stored_buff_1));
        memset(stored_buff_2, 0, sizeof(stored_buff_2));
        memset(stored_buff_3, 0, sizeof(stored_buff_3));
        memset(stored_buff_4, 0, sizeof(stored_buff_4));

        return true;
    }
    return false;
}

void db_lh2_get_current_location(uint32_t *position) {
    memcpy(position, lh2_results, 8 * sizeof(uint32_t));
    _lh2_vars.transfer_counter = 0;
    db_lh2_start_transfer();
}

void db_lh2_start_transfer(void) {
    NRF_PPI->CHENSET = (PPI_CHENSET_CH2_Enabled << PPI_CHENSET_CH2_Pos) |
                       //(PPI_CHENSET_CH3_Enabled << PPI_CHENSET_CH3_Pos);
                       (PPI_CHENSET_CH4_Enabled << PPI_CHENSET_CH4_Pos) |
                       (PPI_CHENSET_CH5_Enabled << PPI_CHENSET_CH5_Pos);
}

void db_lh2_stop_transfer(void) {
    NRF_PPI->CHENCLR = (PPI_CHENCLR_CH2_Enabled << PPI_CHENCLR_CH2_Pos) |
                       //(PPI_CHENCLR_CH3_Enabled << PPI_CHENCLR_CH3_Pos);
                       (PPI_CHENCLR_CH4_Enabled << PPI_CHENCLR_CH4_Pos) |
                       (PPI_CHENCLR_CH5_Enabled << PPI_CHENCLR_CH5_Pos);  // stop receiving data while it thinks
}

//=========================== private ==========================================

/**
 * @brief wiggle the data and envelope lines in a magical way to configure the TS4231 to continuously read for LH2 sweep signals.
 *
 */
void _initialize_ts4231(void) {

    // Configure the wait timer
    db_timer_hf_init();

    // Filip's code define these pins as inputs, and then changes them quickly to outputs. Not sure why, but it works.
    _lh2_pin_set_input(LH2_D_PIN);
    _lh2_pin_set_input(LH2_E_PIN);

