DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
    uint8_t  ii          = 0;  // loop variable for cumulative sum
    uint32_t result      = 0;
    uint32_t b17         = 0;
    uint32_t masked_buff = 0;
    uint32_t poly        = 0b10011111101100111;
    while (buffer != end_buffer0)  // do until buffer reaches one of the saved states
    {
        b17         = buffer & 0x00000001;           // save the "newest" bit of the buffer
        buffer      = (buffer & (0x0001FFFE)) >> 1;  // shift the buffer right, backwards in time
        masked_buff = (buffer) & (poly);             // mask the buffer w/ the selected polynomial
        for (ii = 0; ii < 17; ii++) {
            result = result ^ (((masked_buff) >> ii) & (0x00000001));  // cumulative sum of buffer&poly
        }
        result = result ^ b17;
        buffer = buffer | (result << 16);  // update buffer w/ result
        result = 0;                        // reset result
        count++;
        if ((buffer ^ end_buffer1) == 0x00000000) {
            count  = count + 8192 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer2) == 0x00000000) {
            count  = count + 16384 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer3) == 0x00000000) {
            count  = count + 24576 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer4) == 0x00000000) {
            count  = count + 32768 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer5) == 0x00000000) {
            count  = count + 40960 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer6) == 0x00000000) {
            count  = count + 49152 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer7) == 0x00000000) {
            count  = count + 57344 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer8) == 0x00000000) {
            count  = count + 65536 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer9) == 0x00000000) {
            count  = count + 73728 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer10) == 0x00000000) {
            count  = count + 81920 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer11) == 0x00000000) {
            count  = count + 90112 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer12) == 0x00000000) {
            count  = count + 98304 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer13) == 0x00000000) {
            count  = count + 106496 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer14) == 0x00000000) {
            count  = count + 114688 - 1;
            buffer = end_buffer0;
        }
        if ((buffer ^ end_buffer15) == 0x00000000) {
            count  = count + 122880 - 1;
            buffer = end_buffer0;
        }
    }
    return count;
}

/**
 * @brief Set a pin of port 0 as an INPUT with no pull-up or pull-down
 * @param[in] pin: port 0 pin to configure as input [0-31]
 *
 */
void _lh2_pin_set_input(uint8_t pin) {

    // Configure Data pin as INPUT, with no pullup or pull down.
    NRF_P0->PIN_CNF[pin] = (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos) |
                           (GPIO_PIN_CNF_INPUT_Connect << GPIO_PIN_CNF_INPUT_Pos) |
                           (GPIO_PIN_CNF_PULL_Disabled << GPIO_PIN_CNF_PULL_Pos);
}

/**
 * @brief Set a pin of port 0 as an OUTPUT with standard drive
 * @param[in] pin: port 0 pin to configure as input [0-31]
 *
 */
void _lh2_pin_set_output(uint8_t pin) {

    // Configure Data pin as OUTPUT, with standar power drive current.
    NRF_P0->PIN_CNF[pin] = (GPIO_PIN_CNF_DIR_Output << GPIO_PIN_CNF_DIR_Pos) |   // Set Pin as output
                           (GPIO_PIN_CNF_DRIVE_S0S1 << GPIO_PIN_CNF_DRIVE_Pos);  // Activate high current gpio mode.
}

/**
 * @brief set-up GPIOTE so that events are configured for falling (GPIOTE_CH_IN) and rising edges (GPIOTE_CH_IN_ENV_HiToLo) of the envelope signal
 *
 */
void _gpiote_setup(void) {

    // NRF_GPIOTE->CONFIG[GPIOTE_CH_OUT] =           (GPIOTE_CONFIG_MODE_Task        << GPIOTE_CONFIG_MODE_Pos) | // TODO: remove this event, it exists for debug purposes
    //                                               (OUTPUT_PIN_NUMBER              << GPIOTE_CONFIG_PSEL_Pos) |
    //                                               (OUTPUT_PIN_PORT                << GPIOTE_CONFIG_PORT_Pos) |
    //                                               (GPIOTE_CONFIG_POLARITY_Toggle  << GPIOTE_CONFIG_POLARITY_Pos) |
    //                                               (GPIOTE_CONFIG_OUTINIT_High     << GPIOTE_CONFIG_OUTINIT_Pos);

    NRF_GPIOTE->CONFIG[GPIOTE_CH_IN_ENV_HiToLo] = (GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos) |
                                                  (INPUT_PIN_NUMBER << GPIOTE_CONFIG_PSEL_Pos) |
                                                  (INPUT_PIN_PORT << GPIOTE_CONFIG_PORT_Pos) |
                                                  (GPIOTE_CONFIG_POLARITY_HiToLo << GPIOTE_CONFIG_POLARITY_Pos);

    NRF_GPIOTE->CONFIG[GPIOTE_CH_IN_ENV_LoToHi] = (GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos) |
                                                  (INPUT_PIN_NUMBER << GPIOTE_CONFIG_PSEL_Pos) |
                                                  (INPUT_PIN_PORT << GPIOTE_CONFIG_PORT_Pos) |
                                                  (GPIOTE_CONFIG_POLARITY_LoToHi << GPIOTE_CONFIG_POLARITY_Pos);
}

// setup the PPI
/**
 * @brief start SPI3 at falling edge of envelope, start timer2 at falling edge of envelope, stop/capture timer2 at rising edge of envelope
 *
 */
void _ppi_setup(void) {
    // uint32_t gpiote_output_task_addr  = (uint32_t)&NRF_GPIOTE->TASKS_OUT[GPIOTE_CH_OUT];
    uint32_t gpiote_input_task_addr   = (uint32_t)&NRF_GPIOTE->EVENTS_IN[GPIOTE_CH_IN_ENV_HiToLo];
    uint32_t envelope_input_LoToHi    = (uint32_t)&NRF_GPIOTE->EVENTS_IN[GPIOTE_CH_IN_ENV_LoToHi];
    uint32_t spi3_start_task_addr     = (uint32_t)&NRF_SPIM3->TASKS_START;
    uint32_t spi3_stop_task_addr      = (uint32_t)&NRF_SPIM3->TASKS_STOP;
    uint32_t timer2_start_task_addr   = (uint32_t)&NRF_TIMER2->TASKS_START;
    uint32_t timer2_stop_task_addr    = (uint32_t)&NRF_TIMER2->TASKS_STOP;
    uint32_t timer2_capture_task_addr = (uint32_t)&NRF_TIMER2->TASKS_CAPTURE[0];
    uint32_t timer2_clear_task_addr   = (uint32_t)&NRF_TIMER2->TASKS_CLEAR;

    NRF_PPI->CH[2].EEP   = gpiote_input_task_addr;  // envelope down
    NRF_PPI->CH[2].TEP   = spi3_start_task_addr;    // start spi3 transfer
    NRF_PPI->FORK[2].TEP = timer2_start_task_addr;  // start timer

