DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
    // NRF_PPI->CH[3].EEP    = gpiote_input_task_addr;
    // NRF_PPI->CH[3].TEP    = gpiote_output_task_addr;

    NRF_PPI->CH[4].EEP   = envelope_input_LoToHi;     // envelope up, finished lh2 data
    NRF_PPI->CH[4].TEP   = timer2_capture_task_addr;  // get time it took
    NRF_PPI->FORK[4].TEP = timer2_stop_task_addr;     // stop timer

    NRF_PPI->CH[5].EEP   = envelope_input_LoToHi;
    NRF_PPI->CH[5].TEP   = timer2_clear_task_addr;  // clear timer
    NRF_PPI->FORK[5].TEP = spi3_stop_task_addr;     // stop spi3 transfer
}

void _spi3_setup(void) {
    // Define the necessary Pins in the SPIM peripheral
    NRF_SPIM3->PSEL.MISO = LH2_D_PIN << SPIM_PSEL_MISO_PIN_Pos |                            // Define pin number for MISO pin
                           0 << SPIM_PSEL_MISO_PORT_Pos |                                   // Define pin port for MISO pin
                           SPIM_PSEL_MISO_CONNECT_Connected << SPIM_PSEL_MISO_CONNECT_Pos;  // Enable the MISO pin

    NRF_SPIM3->PSEL.SCK = FAKE_SCK_PIN << SPIM_PSEL_SCK_PIN_Pos |                        // Define pin number for SCK pin
                          1 << SPIM_PSEL_SCK_PORT_Pos |                                  // Define pin port for SCK pin
                          SPIM_PSEL_SCK_CONNECT_Connected << SPIM_PSEL_SCK_CONNECT_Pos;  // Enable the SCK pin

    NRF_SPIM3->PSEL.MOSI = (4UL) << SPIM_PSEL_MOSI_PIN_Pos |
                           1 << SPIM_PSEL_MOSI_PORT_Pos |
                           SPIM_PSEL_MOSI_CONNECT_Connected << SPIM_PSEL_MOSI_CONNECT_Pos;

    // Configure the SPIM peripheral
    NRF_SPIM3->FREQUENCY = SPIM_FREQUENCY_FREQUENCY_M32;                         // Set SPI frequency to 32MHz
    NRF_SPIM3->CONFIG    = SPIM_CONFIG_ORDER_MsbFirst << SPIM_CONFIG_ORDER_Pos;  // Set MsB out first

    // Configure the EasyDMA channel
    // Configuring the READER channel
    NRF_SPIM3->RXD.MAXCNT = SPI3_BUFFER_SIZE;    // Set the size of the input buffer.
    NRF_SPIM3->RXD.PTR    = (uint32_t)m_rx_buf;  // Set the input buffer pointer.
    // Configure the WRITER channel
    NRF_SPIM3->TXD.MAXCNT = SPI3_BUFFER_SIZE;    // Set the size of the output buffer.
    NRF_SPIM3->TXD.PTR    = (uint32_t)m_tx_buf;  // Set the output buffer pointer.

    // Enable the SPIM pripheral
    NRF_SPIM3->ENABLE = SPIM_ENABLE_ENABLE_Enabled << SPIM_ENABLE_ENABLE_Pos;

    // Configure the Interruptions
    NVIC_DisableIRQ(SPIM3_IRQn);  // Disable interruptions while configuring

    NRF_SPIM3->INTENSET = SPIM_INTENSET_END_Enabled << SPIM_INTENSET_END_Pos;  // Enable interruption for when a packet arrives
    NVIC_SetPriority(SPIM3_IRQn, SPIM3_INTERRUPT_PRIORITY);                    // Set priority for Radio interrupts to 1
    NVIC_ClearPendingIRQ(SPIM3_IRQn);
    // Enable SPIM interruptions
    NVIC_EnableIRQ(SPIM3_IRQn);
}

/**
 * @brief timer2 setup, in _ppi_setup() this timer will CLEAR/START at falling edge of envelop signal and STOP/CAPTURE at rising edge of envelope signal
 *
 */
void _timer2_setup(void) {
    NRF_TIMER2->BITMODE   = TIMER_BITMODE_BITMODE_32Bit;
    NRF_TIMER2->PRESCALER = (0UL);  // 16 MHz clock counter

    // timer will START at falling edge of the envelope signal
    // timer will STOP at rising edge of the envelope signal
    // it is the processor's responsibility to read this timer's count value and reset it
}

//=========================== interrupts =======================================

/**
 * @brief SPIM3 interrupt handler
 *
 */
void SPIM3_IRQHandler(void) {
    NVIC_ClearPendingIRQ(SPIM3_IRQn);

    _lh2_vars.transfer_counter++;

    volatile int lp = 0;  // temporary loop variable to go through each byte of the SPI buffer

    // Check if the interrupt was caused by a fully send package
    if (NRF_SPIM3->EVENTS_END) {

        // Clear the Interrupt flag
        NRF_SPIM3->EVENTS_END = 0;

        // load global SPI buffer (m_rx_buf) into four local arrays (stored_buff_1 ... stored_buff_4)
        if (_lh2_vars.transfer_counter == 1) {
            for (lp = 0; lp < SPI3_BUFFER_SIZE; lp++) {
                stored_buff_1[lp] = m_rx_buf[lp];
                m_rx_buf[lp]      = 0x00;
            }
            LH2_envelope_duration_1 = NRF_TIMER2->CC[0];
        } else if (_lh2_vars.transfer_counter == 2) {
            for (lp = 0; lp < SPI3_BUFFER_SIZE; lp++) {
                stored_buff_2[lp] = m_rx_buf[lp];
                m_rx_buf[lp]      = 0x00;
            }
            LH2_envelope_duration_2 = NRF_TIMER2->CC[0];
        } else if (_lh2_vars.transfer_counter == 3) {
            for (lp = 0; lp < SPI3_BUFFER_SIZE; lp++) {
                stored_buff_3[lp] = m_rx_buf[lp];
                m_rx_buf[lp]      = 0x00;
            }
            LH2_envelope_duration_3 = NRF_TIMER2->CC[0];
        } else if (_lh2_vars.transfer_counter == 4) {
            for (lp = 0; lp < SPI3_BUFFER_SIZE; lp++) {
                stored_buff_4[lp] = m_rx_buf[lp];
                m_rx_buf[lp]      = 0x00;
            }
            LH2_envelope_duration_4 = NRF_TIMER2->CC[0];
            db_lh2_stop_transfer();
            _lh2_vars.buffers_ready = true;
        }
    }
}
